import React from 'react';

const PrivacyPolicy: React.FC = () => {
    return (
        <div style={{ padding: '20px', maxWidth: '800px', margin: '0 auto' }}>
            <h1>Политика конфиденциальности</h1>
            <p>
                Ваша конфиденциальность важна для нас. Эта политика объясняет, как мы собираем, используем и защищаем вашу личную информацию.
            </p>
            <h2>Сбор и использование информации</h2>
            <p>
                Мы не собираем личную информацию, если вы добровольно не предоставите ее нам (например, через форму обратной связи). Мы можем автоматически собирать неличную информацию, такую как тип браузера и IP-адрес, для улучшения работы нашего сайта.
            </p>
            <h2>Защита данных</h2>
            <p>
                Мы принимаем разумные меры для защиты вашей информации от несанкционированного доступа.
            </p>
            <p>
                Последнее обновление: Ноябрь 2025 г.
            </p>
        </div>
    );
};

export default PrivacyPolicy;
